## Computers with Descriptions

```
MATCH (c:Computer) WHERE c.description IS NOT NULL RETURN c.name,c.description
```

## Find all computers with Unconstrained Delegation

```go
MATCH (c:Computer {unconstraineddelegation:true}) return c
```

## Find All computer without LAPS and return Computer Name and Date Last Changed in human readable format

```bash
MATCH (C:Computer {enabled: true}) WHERE C.haslaps = false RETURN C.name, datetime({epochSeconds: toInteger(C.pwdlastset) })
```

## Find every user object where the “userpassword” attribute is populated

```
MATCH (u:User) WHERE NOT u.userpassword IS null RETURN u.name,u.userpassword
```

## Find if any domain user has interesting permissions against a GPO:

```
MATCH p=(u:User)-[r:AllExtendedRights|GenericAll|GenericWrite|Owns|WriteDacl|WriteOwner|GpLink*1..]->(g:GPO) RETURN p LIMIT 25
```

## Finds all groups that are not "Admin" groups but still have local admin over systems

```go
MATCH p=(n:Group)-[:AdminTo*1..]->(m:Computer) WHERE not n.admincount RETURN DISTINCT n.name, n.admincount, COUNT(m.name) ORDER BY COUNT(m.name) DESC
```

## Find Groups that can reset passwords

```
MATCH p=(m:Group)-[r:ForceChangePassword]->(n:User) RETURN m.name, n.name ORDER BY m.name
```

## Find what groups have local admin rights           

```
MATCH p=(m:Group)-[r:AdminTo]->(n:Computer) RETURN m.name, n.name ORDER BY m.name

```

## Finding Unsupported Operating Systems

```
MATCH (H:Computer {enabled: true}) WHERE H.operatingsystem =~ '.*(2000|2003|2008|xp|vista|7|me)*.' RETURN H.name, H.operatingsystem

```

## Find users that have never logged on and account is still active

```
MATCH (n:User) WHERE n.lastlogontimestamp=-1.0 AND n.enabled=TRUE RETURN n.name ORDER BY n.name
```

## Kerberoastable Users with a path to DA

```go
MATCH (u:User {hasspn:true}) MATCH (g:Group) WHERE g.name CONTAINS 'DOMAIN ADMINS' MATCH p = shortestPath( (u)-[*1..]->(g) ) RETURN p
```

## List All user GenericALL Rights

Modify as needed to find group over computer, or User over group GenericAll rights or other rights.

```
MATCH (u:User)-[:GenericAll]->(c:User) RETURN u.name, c.name
```
**Non-Admin Users only**
```
MATCH (u:User{admincount:false})-[:GenericAll]->(c:User) RETURN u.name, c.name
```
**User Generic rights over computer and not local admin to computer**
```
MATCH (u:User)-[:GenericAll]->(c:Computer) WHERE  NOT u.admincount AND NOT (u)-[:AdminTo]->(c) RETURN u.name, c.name
```

## List All Domain Admins

```go
MATCH (u:User)-[:MemberOf]->(g:Group {name:'DOMAIN ADMINS@<domain>'}) return u.name, u.displayname
```

## Match users that are not AdminCount 1, have generic all over computers, and no local admin
This should be looking for explicit permissions of users. Not sure if it checks for group delegated permissions.

```
MATCH (u:User)-[:GenericAll]->(c:Computer) WHERE  NOT u.admincount AND NOT (u)-[:AdminTo]->(c) RETURN u.name, c.name

```

## Match users that are not AdminCount 1, have generic all over other users, and no local admin

```
MATCH (u:User)-[:GenericAll]->(c:User) WHERE  NOT u.admincount AND NOT (u)-[:AdminTo]->(c) RETURN u.name, c.name
```

## Match users that are not AdminCount 1, have generic all over other groups, and no local admin

```
Match users that are not AdminCount 1, have generic all over othre users, and no local admin
```

## Non Admin users with privileged ACL’s like genericALL or force password change

```
MATCH (n:User {admincount:False}) MATCH (m:User) WHERE NOT m.name = n.name MATCH p=allShortestPaths((n)-[r:AllExtendedRights|ForceChangePassword|GenericAll|GenericWrite|Owns|WriteDacl|WriteOwner*1..]->(m)) RETURN p
```

## Unconstrained Delegation that aren’t domain controllers

```
MATCH (c1:Computer)-[:MemberOf*1..]->(g:Group) WHERE g.objectsid ENDS WITH '-516' WITH COLLECT(c1.name) AS domainControllers MATCH (c2:Computer {unconstraineddelegation:true}) WHERE NOT c2.name IN domainControllers RETURN c2.name,c2.operatingsystem,c2.distinguishedname ORDER BY c2.name ASC
```

## Users with Descriptions

```
MATCH (u:User) WHERE u.description IS NOT NULL RETURN u.name,u.description
```


## References

https://hausec.com/2019/09/09/bloodhound-cypher-cheatsheet/
https://gist.github.com/joeminicucci/d9fb42f03186f6aaa556cc5f961f537b
https://blog.cptjesus.com/posts/introtocypher